balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F26J53.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR15" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR15" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T5CKI" edc:desc="Input Function T3CKI to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="T5CKI" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR7" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR7" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC1" edc:desc="Input Function IC1 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="IC1" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR8" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR8" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC2" edc:desc="Input Function IC2 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="IC2" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR9" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR9" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC3" edc:desc="Input Function T1G to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="IC3" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="7"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR12" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR12" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1G" edc:desc="Input Function T1G to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="T1G" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR13" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR13" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T3G" edc:desc="Input Function T3G to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="T3G" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR14" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR14" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T5G" edc:desc="Input Function T3G to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="T5G" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR16" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR16" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX2DT2" edc:desc="Input Function RX2DT2 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="RX2DT2" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR17" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR17" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CK2" edc:desc="Input Function CK2 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="CK2" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR21" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR21" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI2" edc:desc="Input Function SDI2 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="SDI2" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR22" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR22" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCK2" edc:desc="Input Function SCK2 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="SCK2" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR23" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR23" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS2" edc:desc="Input Function SS2 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="SS2" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RPINR24" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111" edc:name="RPINR24" edc:nzwidth="8" edc:por="---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT0" edc:desc="Input Function FLT0 to Input Pin Mapping Bits" edc:islanghidden="true" edc:mask="0x1f" edc:name="FLT0" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf00" edc:endaddr="0xf60" edc:regionid="sfr15">
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP10CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CCP10CON" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP10M" edc:desc="" edc:mask="0xf" edc:name="CCP10M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC10B" edc:desc="" edc:mask="0x3" edc:name="DC10B" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP10M0" edc:desc="" edc:mask="0x1" edc:name="CCP10M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10M1" edc:desc="" edc:mask="0x1" edc:name="CCP10M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10M2" edc:desc="" edc:mask="0x1" edc:name="CCP10M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10M3" edc:desc="" edc:mask="0x1" edc:name="CCP10M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC10B0" edc:desc="" edc:mask="0x1" edc:name="DC10B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC10B1" edc:desc="" edc:mask="0x1" edc:name="DC10B1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
